In [1]:
data = {
  '학번' : ['1번', '2번', '3번', '4번', '5번'],
  '이름' : ['김자바', '이자바', '박자바' ,'최캐드', '정캐드'],
  '학급' : ['자바반', '자바반', '자바반', '캐드반', '캐드반'],
  '국어점수' : [70, 90, 70, 100, 90],
  '영어점수' : [90, 70, 80, 70, 90],
  '평균' : [80.0, 80.0, 75.0, 85.0, 90.0],
  '취미' : ['독서', '', '', '요가', '축구']
}

In [3]:
import pandas

df = pandas.DataFrame(data)
df

   학번   이름   학급  국어점수  영어점수    평균  취미
0  1번  김자바  자바반    70    90  80.0  독서
1  2번  이자바  자바반    90    70  80.0
2  3번  박자바  자바반    70    80  75.0
3  4번  최캐드  캐드반   100    70  85.0  요가
4  5번  정캐드  캐드반    90    90  90.0  축구

In [ ]:
# loc를 사용한 특정 데이터 조회
# 문법 : df.loc[조회할 행, 조회할 컬럼]
# loc를 사용하여 데이터를 검색할 때는 index가 설정되어 있어야 함
# loc는 행과 컬럼을 이름으로 검색한다.

In [ ]:
# 학번 컬럼을 DataFrame의 index로 지정
# df.set_index('학번')
df.set_index('학번', inplace=True)

KeyError: "None of ['학번'] are in the columns"

In [10]:
df

     이름   학급  국어점수  영어점수    평균  취미
학번
1번  김자바  자바반    70    90  80.0  독서
2번  이자바  자바반    90    70  80.0
3번  박자바  자바반    70    80  75.0
4번  최캐드  캐드반   100    70  85.0  요가
5번  정캐드  캐드반    90    90  90.0  축구

In [14]:
# 학번이 1번인 학생의 국어점수
print(df.loc['1번', '국어점수'])

70

In [16]:
# 학번이 1번, 2번인 국어, 영어점수를 조회
df.loc[['1번','2번'], ['국어점수', '영어점수']]

    국어점수  영어점수
학번
1번    70    90
2번    90    70

In [17]:
# 학번이 1 ~ 3번인 학생의 국어점수, 영어점수, 평균
df.loc['1번':'3번' , '국어점수':'평균']

    국어점수  영어점수    평균
학번
1번    70    90  80.0
2번    90    70  80.0
3번    70    80  75.0

In [ ]:
# iloc를 이용한 데이터 조회
# iloc는 데이터를 index 번호로 조회
# df.iloc[조회할 행 번호, 조회할 컬럼 번호]

In [19]:
# 학번이 1번인 학생의 국어점수
print(df.iloc[0, 2])

70

In [20]:
# 학번이 1번, 2번인 국어, 영어점수를 조회
df.iloc[[0,1],[2,3]]

    국어점수  영어점수
학번
1번    70    90
2번    90    70

In [ ]:
# 학번이 1 ~ 4번인 학생의 국어점수, 영어점수, 평균
# iloc에서 슬라이실 연산의 마지막 index는 포함하지 않는다.
df.iloc[0:4, 2:5]

    국어점수  영어점수    평균
학번
1번    70    90  80.0
2번    90    70  80.0
3번    70    80  75.0
4번   100    70  85.0